{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFD"
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<s>": 1,
      "</s>": 2,
      "<pad>": 3,
      "!": 4,
      ",": 5,
      "-": 6,
      ".": 7,
      "?": 8,
      "Ċ": 9,
      "Ġ": 10,
      "??": 11,
      "????": 12,
      "Ġ????": 13,
      "Ġ????????": 14,
      "Ġ??????": 15,
      "Ġ?????": 16,
      "Ġ??": 17,
      "Ġ???????": 18,
      "Ġ??????????": 19,
      "Ġ?": 20,
      "Ġ?????????": 21,
      "Ġ???": 22,
      "Ġ?????,": 23,
      "Ġ???????????": 24,
      "Ġ????????????": 25,
      "Ġ????,": 26,
      "Ġ????????,": 27,
      "Ġ????????.": 28,
      "Ġ?????.": 29,
      "Ġ???????.": 30,
      "Ġ??????.": 31,
      "Ġ??????????.": 32,
      "Ġ???????????,": 33,
      "Ġ?????????????": 34,
      "Ġ-": 35,
      "?????": 36,
      "Ġ????.": 37,
      "Ġ??????,": 38,
      "Ġ?????!": 39,
      "Ġ???????,": 40,
      "Ġ??????????,": 41,
      "Ġ?????????,": 42,
      "Ġ?????????.": 43,
      "Ġ???????????.": 44,
      "Ġ????????????,": 45,
      "Ġ????????????.": 46,
      "Ġ?????????????.": 47
    },
    "merges": [
      [
        "?",
        "?"
      ],
      [
        "??",
        "??"
      ],
      [
        "Ġ",
        "????"
      ],
      [
        "Ġ????",
        "????"
      ],
      [
        "Ġ????",
        "??"
      ],
      [
        "Ġ????",
        "?"
      ],
      [
        "Ġ",
        "??"
      ],
      [
        "Ġ??????",
        "?"
      ],
      [
        "Ġ????????",
        "??"
      ],
      [
        "Ġ",
        "?"
      ],
      [
        "Ġ????????",
        "?"
      ],
      [
        "Ġ??",
        "?"
      ],
      [
        "Ġ?????",
        ","
      ],
      [
        "Ġ??????????",
        "?"
      ],
      [
        "Ġ????????",
        "????"
      ],
      [
        "Ġ????",
        ","
      ],
      [
        "Ġ????????",
        ","
      ],
      [
        "Ġ????????",
        "."
      ],
      [
        "Ġ?????",
        "."
      ],
      [
        "Ġ???????",
        "."
      ],
      [
        "Ġ??????",
        "."
      ],
      [
        "Ġ??????????",
        "."
      ],
      [
        "Ġ???????????",
        ","
      ],
      [
        "Ġ????????????",
        "?"
      ],
      [
        "Ġ",
        "-"
      ],
      [
        "????",
        "?"
      ],
      [
        "Ġ????",
        "."
      ],
      [
        "Ġ??????",
        ","
      ],
      [
        "Ġ?????",
        "!"
      ],
      [
        "Ġ???????",
        ","
      ],
      [
        "Ġ??????????",
        ","
      ],
      [
        "Ġ?????????",
        ","
      ],
      [
        "Ġ?????????",
        "."
      ],
      [
        "Ġ???????????",
        "."
      ],
      [
        "Ġ????????????",
        ","
      ],
      [
        "Ġ????????????",
        "."
      ],
      [
        "Ġ?????????????",
        "."
      ]
    ]
  }
}